app/controllers/articles_controller.rb

  def show
    @article = Article.find(article_params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @article = Article.new(article_params)
    # @article.title = article_params[:title]
    # @article.description = article_params[:description]
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2020-05-22 03:13:35.725787"], ["updated_at", "2020-05-22 03:13:35.725787"]]

  def edit
    @article = Article.find(article_params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @article = Article.find(article_params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-05-22 03:13:35.809528"], ["id", 1]]